ZeroZap/xhsc/HC32L021/driver/src/hc32l021_hsi2c.c
/**
 *******************************************************************************
 * @file  hsi2c.c
 * @brief This file provides firmware functions to manage the HSI2C
 @verbatim
   Change Logs:
   Date             Author          Notes
   2024-09-18       MADS            First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2024, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32l021_hsi2c.h"

/**
 * @addtogroup HC32L021_DDL 驱动库
 * @{
 */

/**
 * @defgroup DDL_HSI2C HSI2C模块驱动库
 * @brief HSI2C Driver Library HSI2C模块驱动库
 * @{
 */
/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/
/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/
/**
 * @addtogroup HSI2C_Global_Variables HSI2C全局变量定义
 * @{
 */
en_hsi2c_status_machine_t enMasterStatusMachine = Hsi2cStatusStart; /* 主机状态机状态 */
stc_hsi2c_master_init_t   stcHsi2cMasterInit    = {0x0u};           /* 主机初始化结构体 */
stc_hsi2c_slave_init_t    stcHsi2cSlaveInit     = {0x0u};           /* 从机初始化结构体 */
stc_hsi2c_com_t           stcHsi2cCom           = {0x0u};           /* 通信结构体 */
/**
 * @}
 */
/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup HSI2C_Global_Functions HSI2C全局函数定义
 * @{
 */

/**
 * @addtogroup HSI2C_Global_Functions HSI2C全局函数定义
 * @{
 */

/**
 * @brief  HSI2C主机初始化
 * @param  [in] HSI2Cx HSI2Cx通道 @ref HSI2C_TypeDef
 * @param  [in] pstcHsi2cInit HSI2C主机配置结构体 @ref stc_hsi2c_master_init_t
 * @param  [in] u32SrcClockHz 时钟频率
 * @retval en_result_t
 *           - Ok: 设置成功
 *           - Error: 设置失败
 */
en_result_t HSI2C_MasterInit(HSI2C_TypeDef *HSI2Cx, stc_hsi2c_master_init_t *pstcHsi2cInit, uint32_t u32SrcClockHz)
{
    /* Master reset */
    if (pstcHsi2cInit->bResetBeforeInit)
    {
        HSI2C_MasterReset(HSI2Cx);
    }

    /* Debug enable setting */
    MODIFY_REG32(HSI2Cx->MCR, HSI2C_MCR_DBGEN_Msk, pstcHsi2cInit->u32EnableDebug);

    /* Master config register setting */
    HSI2C_MasterMcfgr1Config(HSI2Cx, (stc_hsi2c_master_config1_t *)(&pstcHsi2cInit->stcMasterConfig1));
    HSI2C_MasterMcfgr2Config(HSI2Cx, (stc_hsi2c_master_config2_t *)(&pstcHsi2cInit->stcMasterConfig2));
    HSI2C_MasterMcfgr3Config(HSI2Cx, (stc_hsi2c_master_config3_t *)(&pstcHsi2cInit->stcMasterConfig3));

    /* Baud rate setting */
    if (Ok != HSI2C_MasterBaudRateSet(HSI2Cx, pstcHsi2cInit, u32SrcClockHz))
    {
        return Error;
    }

    /* Master enable, slave disable */
    HSI2C_SlaveDisable(HSI2Cx);
    HSI2C_MasterEnable(HSI2Cx);

    return Ok;
}

/**
 * @brief  HSI2C主机波特率设置
 * @param  [in] HSI2Cx HSI2Cx通道 @ref HSI2C_TypeDef
 * @param  [in] pstcHsi2cInit HSI2C主机配置结构体 @ref stc_hsi2c_master_init_t
 * @param  [in] u32SrcClockHz 时钟频率
 * @retval en_result_t
 *           - Ok: 设置成功
 *           - Error: 设置失败
 */
en_result_t HSI2C_MasterBaudRateSet(HSI2C_TypeDef *HSI2Cx, const stc_hsi2c_master_init_t *pstcHsi2cInit, uint32_t u32SrcClockHz)
{
    uint8_t  u8MasterEnableStatus = 0x0u;
    uint8_t  u8FilterScl          = 0x0u;
    uint8_t  u8Prescale           = 0x0u;
    uint32_t u32ClockCycle        = 0x0u;
    uint32_t u32SclLatency        = 0x0u;
    uint32_t u32SclPeriod         = 0x0u;
    uint32_t u32ErrorOffset       = 0x0u;
    uint32_t u32CalculateBaudRate = 0x0u;
    uint16_t u16Divider           = 1u;

    uint8_t  u8ClockHigh      = 0x0u;
    uint8_t  u8ClockLow       = 0x0u;
    uint8_t  u8HoldDelay      = 0x0u;
    uint8_t  u8DataValidDelay = 0x0u;
    uint8_t  u8BestClockCycle = 0x0u;
    uint8_t  u8BestPrescale   = 0x0u;
    uint8_t  u8BestDivider    = 0x0u;
    uint32_t u32BestError     = 0xFFFFFFFFu;

    /* Disable slave mode and backup master enable status */
    HSI2Cx->SCR0         = 0;
    u8MasterEnableStatus = (uint8_t)((HSI2Cx->MCR & HSI2C_MCR_MEN_Msk) >> HSI2C_MCR_MEN_Pos);
    HSI2Cx->MCR_f.MEN    = 0u;

    /* Baud rate = (u32SrcClockHz / 2 ^ PRESCALE) / (CLKHI + CLKLO + 2 + SCL_LATENCY)
     * SCL_LATENCY = ROUNDDOWN ( (2 + FILTSCL + SCL_RISETIME) / (2 ^ PRESCALE) )
     */
    u8FilterScl = (uint8_t)((HSI2Cx->MCFGR2 & HSI2C_MCFGR2_FILTSCL_Msk) >> HSI2C_MCFGR2_FILTSCL_Pos);
    for (u8Prescale = 0u; u8Prescale <= 7u; u8Prescale++)
    {
        /* Calculate the u32ClockCycle, u32ClockCycle = CLKLO + CLKHI, u16Divider = 2 ^ u8Prescale */
        u32SclLatency    = (2u + u8FilterScl) / u16Divider;
        uint32_t u32Temp = (uint32_t)((10u * u32SrcClockHz / pstcHsi2cInit->u32BaudRateHz / u16Divider + 5u) / 10u);
        if (u32Temp >= u32SclLatency + 2u)
        {
            u32ClockCycle = u32Temp - u32SclLatency - 2u;
        }
        else
        {
            u32ClockCycle = 0u;
        }

        if (u32ClockCycle > (120u - u32SclLatency))
        {
            u16Divider *= 2u;
            if (u16Divider == 256)
            {
                return Error; /* Invalid setting of source clock or baud rate */
            }
            else
            {
                continue;
            }
        }

        /* Calculate the computed baudrate and compare it with the desired baudrate */
        u32CalculateBaudRate = (u32SrcClockHz / (uint32_t)u16Divider) / ((uint32_t)u32ClockCycle + 2U + u32SclLatency);
        u32ErrorOffset       = pstcHsi2cInit->u32BaudRateHz > u32CalculateBaudRate ? pstcHsi2cInit->u32BaudRateHz - u32CalculateBaudRate :
                                                                                     u32CalculateBaudRate - pstcHsi2cInit->u32BaudRateHz;
        if (u32ErrorOffset < u32BestError)
        {
            u8BestPrescale   = u8Prescale;
            u8BestDivider    = u16Divider;
            u8BestClockCycle = u32ClockCycle;
            u32BestError     = u32ErrorOffset;

            /* Target baud rate is achieved */
            if (u32ErrorOffset == 0u)
            {
                break;
            }
        }
        u16Divider *= 2u;
    }

