ZeroZap/xhsc/HC32L021/driver/src/hc32l021_hsi2c.c
    u32SclLatency = (2u + u8FilterScl) / u8BestDivider;
    u32SclPeriod  = u32SrcClockHz / pstcHsi2cInit->u32BaudRateHz / u8BestDivider;
    /* Clock high period */
    u8ClockHigh = (u8BestClockCycle - u32SclLatency) / 2u;
    while (u8ClockHigh > (u8BestClockCycle - 52u * u32SclPeriod / 100u + 1u))
    {
        if (u8ClockHigh > 1u)
        {
            u8ClockHigh--;
        }
        else
        {
            u8ClockHigh = 1u;
            break;
        }
    }
    if (u8ClockHigh < 1)
    {
        u8ClockHigh++;
    }

    /* Clock low period */
    if (u8BestClockCycle >= u8ClockHigh)
    {
        u8ClockLow = (uint32_t)u8BestClockCycle - (uint32_t)u8ClockHigh;
    }
    else
    {
        return Error; /* Invalid setting of source clock or baud rate */
    }
    if (u8ClockHigh >= u8ClockLow)
    {
        return Error; /* Invalid setting of source clock or baud rate */
    }
    /* Setup hold delay */
    u8HoldDelay = (uint8_t)(u32SclPeriod / 2u) - 1u;
    /* Data valid delay */
    u8DataValidDelay = (uint8_t)(u32SclPeriod / 4u) - 1u;
    /* Filter SDA */
    if ((u32SrcClockHz / pstcHsi2cInit->u32BaudRateHz / 20u) > (u8BestDivider + 2u))
    {
        /* Read out the FILTSDA configuration, if it is smaller than expected, change the setting. */
        uint8_t u8FilterSda = (uint8_t)((HSI2Cx->MCFGR2 & HSI2C_MCFGR2_FILTSDA_Msk) >> HSI2C_MCFGR2_FILTSDA_Pos);
        if (u8FilterSda < (u32SrcClockHz / pstcHsi2cInit->u32BaudRateHz / 20u - u8BestDivider - 2u))
        {
            u8FilterSda = (uint8_t)(u32SrcClockHz / pstcHsi2cInit->u32BaudRateHz / 20u) - u8BestDivider - 2u;
        }
        MODIFY_REG32(HSI2Cx->MCFGR2, HSI2C_MCFGR2_FILTSDA_Msk, ((uint32_t)u8FilterSda << HSI2C_MCFGR2_FILTSDA_Pos));
    }

    /* Set CLKHI, CLKLO, SETHOLD, DATAVD value */
    HSI2Cx->MCCR0 = ((uint32_t)u8ClockHigh << HSI2C_MCCR0_CLKHI_Pos) | ((uint32_t)u8ClockLow << HSI2C_MCCR0_CLKLO_Pos)
                    | ((uint32_t)u8HoldDelay << HSI2C_MCCR0_SETHOLD_Pos) | ((uint32_t)u8DataValidDelay << HSI2C_MCCR0_DATAVD_Pos);

    /* Set prescale value */
    MODIFY_REG32(HSI2Cx->MCFGR1, HSI2C_MCFGR1_PRESCALE_Msk, ((uint32_t)u8BestPrescale << HSI2C_MCFGR1_PRESCALE_Pos));

    /* Restore master enable status */
    HSI2Cx->MCR_f.MEN = u8MasterEnableStatus;

    return Ok;
}
/**
 * @brief  HSI2C主机中断传输设置
 * @param  [in] HSI2Cx HSI2Cx通道 @ref HSI2C_TypeDef
 * @param  [in] pu8Data 传输数据首地址
 * @param  [in] u32Size 传输数据长度（字节）
 * @retval en_result_t
 *           - Ok: 设置成功
 *           - Error: 设置失败
 */
en_result_t HSI2C_MasterTransferInt(HSI2C_TypeDef *HSI2Cx, uint8_t *pu8Data, uint32_t u32Size)
{
    en_result_t enResult = Ok;
    DDL_ZERO_STRUCT(stcHsi2cCom);

    if (Hsi2cComIdle == stcHsi2cCom.enComStatus)
    {
        if (TRUE == HSI2C_MasterFlagGet(HSI2Cx, HSI2C_MASTER_FLAG_BBF)) /* Bus busy */
        {
            enResult = Error;
        }
        else
        {
            enMasterStatusMachine      = Hsi2cStatusStart;
            stcHsi2cCom.HSI2CxBaseAddr = HSI2Cx;
            stcHsi2cCom.enComStatus    = Hsi2cComBusy;
            stcHsi2cCom.u32DataIndex   = 0;
            stcHsi2cCom.u32Len         = u32Size;
            stcHsi2cCom.pu8Buf         = pu8Data;

            stcHsi2cCom.u32RxSize = (uint16_t)stcHsi2cCom.u32Len;

            HSI2C_MasterIntDisable(HSI2Cx, HSI2C_MASTER_INT_ALL);     /* Disable interrupts */
            HSI2C_MasterFlagClear(HSI2Cx, HSI2C_MASTER_FLAG_CLR_ALL); /* Clear flags */

            HSI2Cx->MCFGR1 &= ~HSI2C_MCFGR1_AUTOSTOP_Msk; /* Disable auto-stop */

            HSI2C_MasterIntEnable(HSI2Cx, HSI2C_MASTER_INT_ALL); /* Enable interrupts */
        }
    }
    else
    {
        enResult = Error;
    }

    return enResult;
}

/**
 * @brief  HSI2C主机状态机控制（Start）
 * @retval None
 */
void HSI2C_MasterStatusMachineStart(void)
{
    if (stcHsi2cMasterInit.u8SubAddrSize != 0x0u) /* 需要发送Sub address */
    {
        HSI2C_MasterStart(stcHsi2cCom.HSI2CxBaseAddr, stcHsi2cMasterInit.u8SlaveAddr, Hsi2cMasterWriteSlaveRead); /* Start 主机写，从机读 */
        enMasterStatusMachine = Hsi2cStatusSubAddr;                                                               /* 状态：发送Sub address */
    }
    else /* 无需发送Sub address */
    {
        if (stcHsi2cMasterInit.enDir == Hsi2cMasterWriteSlaveRead) /* 主机写，从机读 */
        {
            HSI2C_MasterStart(stcHsi2cCom.HSI2CxBaseAddr, stcHsi2cMasterInit.u8SlaveAddr, Hsi2cMasterWriteSlaveRead); /* Start 主机写，从机读 */
            enMasterStatusMachine = Hsi2cStatusTransData;                                                             /* 状态：传送数据 */
        }
        else /* 主机读，从机写 */
        {
            HSI2C_MasterStart(stcHsi2cCom.HSI2CxBaseAddr, stcHsi2cMasterInit.u8SlaveAddr, Hsi2cMasterReadSlaveWrite); /* Start 主机读，从机写 */
            enMasterStatusMachine = Hsi2cStatusRxCmd;                                                                 /* 状态：接收命令 */
        }
    }
}

/**
 * @brief  HSI2C主机状态机控制（Sub address）
 * @retval None
 */
void HSI2C_MasterStatusMachineSubAddr(void)
{
    if (stcHsi2cCom.u32DataIndex < stcHsi2cMasterInit.u8SubAddrSize) /* 发送Sub address */
    {
        stcHsi2cCom.HSI2CxBaseAddr->MTDR =
            HSI2C_CMD_TX_DATA | (uint32_t)(stcHsi2cMasterInit.u8SubAddr[stcHsi2cMasterInit.u8SubAddrSize - stcHsi2cCom.u32DataIndex - 1]);
        stcHsi2cCom.u32DataIndex++;

        if (stcHsi2cCom.u32DataIndex >= stcHsi2cMasterInit.u8SubAddrSize)
        {                                                              /* Sub address已发送完成 */
            if (stcHsi2cMasterInit.enDir == Hsi2cMasterWriteSlaveRead) /* 主机写，从机读 */
            {
                enMasterStatusMachine = Hsi2cStatusTransData; /* 状态：传送数据 */
            }
            else /* 主机读，从机写 */
            {
                if (stcHsi2cMasterInit.u8SubAddrSize != 0x0u) /* 已发送Sub address */
                {
                    enMasterStatusMachine = Hsi2cStatusRestart; /* 状态：Restart */
                }
                else /* 未发送Sub address */
                {
                    enMasterStatusMachine = Hsi2cStatusRxCmd; /* 状态：接收命令 */
                }
            }
            stcHsi2cCom.u32DataIndex = 0;
        }
    }
}

/**
 * @brief  HSI2C主机状态机控制（Restart）
 * @retval None
 */
void HSI2C_MasterStatusMachineRestart(void)
{
    if (stcHsi2cMasterInit.enDir == Hsi2cMasterReadSlaveWrite)
    {
        HSI2C_MasterStart(stcHsi2cCom.HSI2CxBaseAddr, stcHsi2cMasterInit.u8SlaveAddr, Hsi2cMasterReadSlaveWrite); /* Restart 主机读，从机写 */
        enMasterStatusMachine = Hsi2cStatusRxCmd;                                                                 /* 状态：接收命令 */
    }
}

/**
 * @brief
 * @retval None
 */
/**
 * @brief  HSI2C主机状态机控制（Receive command）
 * @param  [in] pu32RxLen 接收数据长度指针值
 * @retval None
 */
void HSI2C_MasterStatusMachineRxCmd(uint32_t *pu32RxLen)
{
    if (stcHsi2cMasterInit.enDir == Hsi2cMasterReadSlaveWrite) /* 主机读，从机写 */
    {
        if (*pu32RxLen > 256U) /* Send receive and length(高字节) command */
        {
            stcHsi2cCom.HSI2CxBaseAddr->MTDR = (uint32_t)(HSI2C_CMD_RX_DATA) | (0xFFul << HSI2C_MTDR_DATA_Pos);
            *pu32RxLen                      -= 256U;
        }
        else /* Send receive and length(低字节) command */
        {
            stcHsi2cCom.HSI2CxBaseAddr->MTDR = (uint32_t)(HSI2C_CMD_RX_DATA) | ((uint32_t)(stcHsi2cCom.u32RxSize - 1U) << HSI2C_MTDR_DATA_Pos);
            enMasterStatusMachine            = Hsi2cStatusTransData; /* 状态：传送数据 */
        }
    }
}

/**
 * @brief  HSI2C主机状态机控制（Data transfer）
 * @retval None
 */
void HSI2C_MasterStatusMachineTrans(void)
{
    if (stcHsi2cCom.u32DataIndex >= stcHsi2cCom.u32Len) /* Transfer length is finished */
    {
        if (stcHsi2cMasterInit.enDir == Hsi2cMasterWriteSlaveRead) /* 主机写，从机读 */
        {
            enMasterStatusMachine = Hsi2cStatusStop; /* 状态：Stop */
        }
        else /* 主机读，从机写 */
        {
            HSI2C_MasterStop(stcHsi2cCom.HSI2CxBaseAddr); /* Send stop command */
            enMasterStatusMachine = Hsi2cStatusWaitEnd;   /* 状态：等待结束 */
            /* Will send NACK automatically when Rx transfer size is finished */
        }
        stcHsi2cCom.u32DataIndex = 0;
    }
}

/**
 * @brief  HSI2C主机状态机控制（Stop）
 * @retval None
 */
void HSI2C_MasterStatusMachineStop(void)
{
    if (stcHsi2cMasterInit.enDir == Hsi2cMasterWriteSlaveRead) /* 主机写，从机读 */
    {
        HSI2C_MasterStop(stcHsi2cCom.HSI2CxBaseAddr); /* Send stop command */
        enMasterStatusMachine = Hsi2cStatusWaitEnd;   /* 状态：等待结束 */
    }
}

/**
 * @brief  HSI2C主机轮询传输设置
 * @param  [in] HSI2Cx HSI2Cx通道 @ref HSI2C_TypeDef
 * @param  [in] pu8Data 传输数据首地址
 * @param  [in] u32Size 传输数据长度（字节）
 * @param  [in] u32Timeout 传输超时时间
 * @retval en_result_t
 *           - Ok: 设置成功
 *           - Error: 设置失败
 *           - ErrorTimeout：超时
 */
en_result_t HSI2C_MasterTransferPoll(HSI2C_TypeDef *HSI2Cx, uint8_t *pu8Data, uint32_t u32Size, uint32_t u32Timeout)
{
    uint32_t    u32Flag  = 0;
    en_result_t enResult = Ok;
    DDL_ZERO_STRUCT(stcHsi2cCom);

    if (Hsi2cComIdle == stcHsi2cCom.enComStatus)
    {
        if (TRUE == HSI2C_MasterFlagGet(HSI2Cx, HSI2C_MASTER_FLAG_BBF))
        {
            enResult = Error;
        }
        else
        {
            enMasterStatusMachine = Hsi2cStatusStart;

            stcHsi2cCom.HSI2CxBaseAddr = HSI2Cx;
            stcHsi2cCom.enComStatus    = Hsi2cComBusy;
            stcHsi2cCom.u32DataIndex   = 0;
            stcHsi2cCom.u32Len         = u32Size;
            stcHsi2cCom.pu8Buf         = pu8Data;

            stcHsi2cCom.u32RxSize = stcHsi2cCom.u32Len;

            HSI2C_MasterFlagClear(HSI2Cx, HSI2C_MASTER_FLAG_CLR_ALL); /* Clear flags */

