ZeroZap/xhsc/HC32L021/driver/src/hc32l021_hsi2c.c
            HSI2Cx->MCFGR1 &= ~HSI2C_MCFGR1_AUTOSTOP_Msk; /* Disable auto-stop */

            while (1)
            {
                if (0x0u == u32Timeout--)
                {
                    enResult = ErrorTimeout; /* 等待超时 */
                    break;
                }
                u32Flag                          = stcHsi2cCom.HSI2CxBaseAddr->MSR;
                stcHsi2cCom.HSI2CxBaseAddr->MSCR = u32Flag;

                if (Hsi2cComSuccess == HSI2C_MasterErrorGet(u32Flag))
                {
                    switch (enMasterStatusMachine)
                    {
                        case Hsi2cStatusStart:
                            HSI2C_MasterStatusMachineStart();
                            break;
                        case Hsi2cStatusSubAddr:
                            if ((u32Flag & HSI2C_MSR_TDF_Msk) == HSI2C_MSR_TDF_Msk)
                            {
                                HSI2C_MasterStatusMachineSubAddr();
                            }
                            break;
                        case Hsi2cStatusRestart:
                            if ((u32Flag & HSI2C_MSR_TDF_Msk) == HSI2C_MSR_TDF_Msk)
                            {
                                HSI2C_MasterStatusMachineRestart();
                            }
                            break;
                        case Hsi2cStatusRxCmd:
                            if ((u32Flag & HSI2C_MSR_TDF_Msk) == HSI2C_MSR_TDF_Msk)
                            {
                                HSI2C_MasterStatusMachineRxCmd(&stcHsi2cCom.u32RxSize);
                            }
                            break;
                        case Hsi2cStatusTransData:
                            if (stcHsi2cCom.u32DataIndex < stcHsi2cCom.u32Len) /* Data transmit or receive */
                            {
                                if ((u32Flag & HSI2C_MSR_TDF_Msk) == HSI2C_MSR_TDF_Msk)
                                {
                                    if (stcHsi2cMasterInit.enDir == Hsi2cMasterWriteSlaveRead) /* Transmit */
                                    {
                                        HSI2C_MasterWriteData(stcHsi2cCom.HSI2CxBaseAddr, stcHsi2cCom.pu8Buf[stcHsi2cCom.u32DataIndex++]);
                                    }
                                }
                                if ((u32Flag & HSI2C_MSR_RDF_Msk) == HSI2C_MSR_RDF_Msk)
                                {
                                    if (stcHsi2cMasterInit.enDir == Hsi2cMasterReadSlaveWrite) /* Recieve */
                                    {
                                        if (Ok == HSI2C_MasterReadData(stcHsi2cCom.HSI2CxBaseAddr, &stcHsi2cCom.pu8Buf[stcHsi2cCom.u32DataIndex]))
                                        {
                                            stcHsi2cCom.u32DataIndex++;
                                        }
                                    }
                                }
                            }
                            HSI2C_MasterStatusMachineTrans();
                            break;
                        case Hsi2cStatusStop:
                            if ((u32Flag & HSI2C_MSR_TDF_Msk) == HSI2C_MSR_TDF_Msk)
                            {
                                HSI2C_MasterStatusMachineStop();
                            }
                            break;
                        case Hsi2cStatusWaitEnd:
                            /* Wait for transfer end */
                            if (u32Flag & HSI2C_MSR_SDF_Msk)
                            {
                                stcHsi2cCom.enComStatus = Hsi2cComIdle;
                            }
                            break;
                        default:
                            break;
                    }

                    if (stcHsi2cCom.enComStatus == Hsi2cComIdle)
                    {
                        break; /* Transfer完成 */
                    }
                }
                else /* Error handling */
                {
                    /* Disable all master interrupts */
                    HSI2C_MasterIntDisable(stcHsi2cCom.HSI2CxBaseAddr, HSI2C_MASTER_INT_ALL);

                    /* Arbitration lost? */
                    if (u32Flag & HSI2C_MSR_ALF_Msk)
                    {
                        /* Reset master */
                        HSI2C_MasterReset(HSI2Cx);
                    }
                    /* Pin low timeout? */
                    else if (u32Flag & HSI2C_MSR_PLTF_Msk)
                    {
                        /* Reset master */
                        HSI2C_MasterReset(HSI2Cx);
                        /* ======================================= */
                        /* ==========       WARNING       ======== */
                        /* ======================================= */
                        /* 1. 根据实际情况添加代码处理引脚低条件      */
                        /* 2. 当引脚低超时持续时，PLTF不能被清除掉    */
                        /* 3. 在I2C可以开始启动条件之前，必须清除PLTF */
                    }
                    /* Master busy? */
                    else if (u32Flag & HSI2C_MSR_MBF_Msk)
                    {
                        /* Send stop command */
                        HSI2C_MasterStop(stcHsi2cCom.HSI2CxBaseAddr);
                    }
                    else
                    {
                        ;
                    }

                    stcHsi2cCom.enComStatus = Hsi2cComIdle;
                    enResult                = Error;
                    break;
                }
            }
        }
    }
    else
    {
        enResult = Error;
    }
    return enResult;
}

/**
 * @brief  HSI2C从机初始化
 * @param  [in] HSI2Cx HSI2Cx通道 @ref HSI2C_TypeDef
 * @param  [in] pstcHsi2cInit HSI2C从机配置结构体 @ref stc_hsi2c_slave_init_t
 * @param  [in] u32SrcClockHz 时钟频率
 * @retval None
 */
void HSI2C_SlaveInit(HSI2C_TypeDef *HSI2Cx, stc_hsi2c_slave_init_t *pstcHsi2cInit, uint32_t u32SrcClockHz)
{
    /* Slave reset */
    if (pstcHsi2cInit->bResetBeforeInit)
    {
        HSI2C_SlaveReset(HSI2Cx);
    }

