ZeroZap/xhsc/HC32L021/driver/src/hc32l021_hsi2c.c
    /* Transmit NACK */
    SET_REG32_BIT(stcHsi2cCom.HSI2CxBaseAddr->STAR, HSI2C_STAR_TXNACK_Msk);
}

/**
 * @brief  HSI2C从机ACK/NACK发送
 * @param  [in] HSI2Cx HSI2Cx通道 @ref HSI2C_TypeDef
 * @param  [in] u32AckNack ACK/NACK @ref HSI2C_Slave_Transfer_Ack_Nack
 * @retval None
 */
void HSI2C_SlaveTransNack(HSI2C_TypeDef *HSI2Cx, uint32_t u32AckNack)
{
    MODIFY_REG32(HSI2Cx->STAR, HSI2C_STAR_TXNACK_Msk, u32AckNack);
}

/**
 * @brief  HSI2C 10位地址模式获取高字节
 * @param  [in] u16AddrData 从机设备地址
 * @retval uint8_t 10位从机设备地址的高字节
 */
uint8_t HSI2C_10BitAddrMdHighBitsGet(uint16_t u16AddrData)
{
    return ((uint8_t)((u16AddrData >> 8) & 0x03u) | 0x78u);
}

/**
 * @brief  HSI2C 10位地址模式获取低字节
 * @param  [in] u16AddrData 从机设备地址
 * @retval uint8_t 10位从机设备地址的低字节
 */
uint8_t HSI2C_10BitAddrMdLowBitsGet(uint16_t u16AddrData)
{
    return (uint8_t)((u16AddrData & 0xFFu));
}

/**
 * @brief  主机结构体初始化
 * @param  [in] pstcInit 初始化结构体 @ref stc_hsi2c_master_init_t
 * @retval None
 */
void HSI2C_MasterStcInit(stc_hsi2c_master_init_t *pstcInit)
{
    /* 初始值清零 */
    DDL_ZERO_STRUCT(*pstcInit);

    pstcInit->bResetBeforeInit                    = FALSE;
    pstcInit->u32EnableDebug                      = HSI2C_MASTER_DEBUG_OFF;
    pstcInit->u32BaudRateHz                       = 0;
    pstcInit->u8SlaveAddr                         = 0;
    pstcInit->enDir                               = Hsi2cMasterWriteSlaveRead;
    pstcInit->stcMasterConfig2.u32SdaFilterEnable = HSI2C_MASTER_FILTBPSDA_ENABLE;
    pstcInit->stcMasterConfig2.u32SclFilterEnable = HSI2C_MASTER_FILTBPSCL_ENABLE;
    pstcInit->u32SubAddr                          = 0;
    pstcInit->u8SubAddrSize                       = 0;
}
/**
 * @}
 */

/**
 * @brief  从机结构体初始化
 * @param  [in] pstcInit 初始化结构体 @ref stc_hsi2c_slave_init_t
 * @retval None
 */
void HSI2C_SlaveStcInit(stc_hsi2c_slave_init_t *pstcInit)
{
    /* 初始值清零 */
    DDL_ZERO_STRUCT(*pstcInit);

    pstcInit->bResetBeforeInit = FALSE;
    pstcInit->u32SlaveAddr0    = 0;
    pstcInit->u32SlaveAddr1    = 0;
    pstcInit->enDir            = Hsi2cMasterWriteSlaveRead;
    pstcInit->u8SubAddrSize    = 0;
}
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
